function game() {
    // שם המשתמשת
    var user_name = prompt("איך קוראים לך?");
    alert("תמיד רצית לדעת איזו חיה הכי מתאימה לך, " + user_name + "?! \nהיום תגלי!");
    alert("תעני כל פעם את מספר התשובה הרלוונטית לך, ובסוף נחשוף לך את התשובה!");

    var sum = 0;

    var answer1 = prompt("שאלה ראשונה: \nמה עושה אותך הכי שמחה אחרי יום ארוך?\n1 - טיול בחוץ באוויר הפתוח\n2 - להתכרבל בפינה שקטה עם ספר או סדרה\n3 - לפטפט בלי סוף עם מישהו שמקשיב");
    if (answer1 < 1 || answer1 > 3) {
        alert("התשובה לא תקינה");
    } else {
        answer1 = Number(answer1);
        sum += answer1;
    }

    var answer2 = prompt("שאלה שניה: \nאיך את הכי אוהבת לבלות זמן עם חברים?\n1 - לצאת איתם להרפתקה או פעילות בחוץ\n2 - להזמין כמה קרובים הביתה לערב רגוע\n3 - לדבר איתם שעות, גם בלי הפסקה");
    answer2 = Number(answer2);
    sum += answer2;

    var answer3 = prompt("שאלה שלישית: \nמה הכי חשוב לך בחיית מחמד?\n1 - נאמנות, אהבה ללא תנאים ואנרגיה\n2 - עצמאות, שקט ותחושת קרבה בלי לחץ\n3 - שתהיה חכמה, משעשעת ותמיד תפתיע אותך");
    answer3 = Number(answer3);
    sum += answer3;

    // חידה
    var num = prompt("הכניסי מספר בעל 3 ספרות");
    if (num > 99 && num < 1000) {
        alert("מוכנה לגלות?! תופים תופים!");
        if (sum <= 5) {
            alert("מזל טוב! החיה שהכי מתאימה לך היא כלב! 🐶\nכלבים הם נאמנים, מלאי שמחה ואנרגיה – בדיוק כמוך!");
        } else if (sum <= 7) {
            alert("מזל טוב! החיה שהכי מתאימה לך היא חתול! 🐱\nחתולים יודעים להעריך שקט, עצמאות וחום – בדיוק כמוך!");
        } else {
            alert("מזל טוב! החיה שהכי מתאימה לך היא תוכי! 🦜\nתוכים הם חכמים, סקרנים ומלאי אישיות – בדיוק כמוך!");
        }
    }
}
